const imagesArray = [
    {
        img: "https://shefcheburek.ru/images/contacts/1.jpg",
        description: "Открытие нашего второго кафе",
        id: 1,
    },
    {
        img: "https://shefcheburek.ru/images/contacts/2.jpg",
        description: "Как говорит К. Ивлев, когда вкусно, тогда вкусно 🤤 Чебуреки чебупицца, жульен и молочный коктейль, в котором молоко и мороженое без ЗМЖ.",
        id: 2,
    },
    {
        img: "https://shefcheburek.ru/images/contacts/3.jpg",
        description: "Чебурдечко - чебурек в форме 🧡, отличный повод выразить свою любовь 🥰.С любовью к вам и чебурекам🤗",
        id: 3,
    },
    {
        img: "https://shefcheburek.ru/images/contacts/4.jpg",
        description: "Мини-чебуречки с мясными начинками: говядина, свинина-говядина, курица. Деткам очень нравится",
        id: 4,
    },
    {
        img: "https://shefcheburek.ru/images/contacts/5.jpg",
        description: "Вечер - повод прогуляться и выпить кофе ☕ с пончиками 🍩",
        id: 5,
    },
    {
        img: "https://shefcheburek.ru/images/contacts/6.jpg",
        description: "Проведите выходные с пользой🤗 Побалуйте себя вкусными чебуреками и чистой кухней😉 или закажи доставку 🚚 по телефону 89872401555",
        id: 6,
    },
    {
        img: "https://shefcheburek.ru/images/contacts/7.jpg",
        description: "Основатель Кафе Шеф Чебурек - Пирко Дмитрий",
        id: 7,
    },
    {
        img: "https://shefcheburek.ru/images/contacts/8.jpg",
        description: "Вкусняшки от Шеф Чебурек",
        id: 8,
    }
];
export default imagesArray